Revit.AnalysisDisplay.FaceAnalysisDisplay.#ctor(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Reference,System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.UV},System.Collections.Generic.IEnumerable{System.Double})
Create a Point Analysis Display in the current view
view:
faceReference:
sampleLocations:
samples:

Revit.AnalysisDisplay.FaceAnalysisDisplay.InternalSetSpatialFieldValues(System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.UV},System.Collections.Generic.IEnumerable{System.Double})
Set the spatial field values for the current spatial field primitive.  The two
input sequences should be of the same length.
pointLocations:
values:

Revit.AnalysisDisplay.FaceAnalysisDisplay.ByViewFacePointsAndValues(Revit.Elements.Views.View,System.Object,System.Double[][],System.Double[])
Show a colored Face Analysis Display in the Revit View
view:
elementFaceReference:
sampleUvPoints:
samples:
Returns: